notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-27 Thu 15:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes on 100-problems from project euler</title>
<meta name="author" content="k3ut0i" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Notes on 100-problems from project euler</h1>

<div id="outline-container-org3d02684" class="outline-2">
<h2 id="org3d02684">Some notes on my solutions</h2>
<div class="outline-text-2" id="text-org3d02684">
<p>
1-25 are re-done in <a href="learning-julia.html">julia</a>.
</p>
</div>
<div id="outline-container-orgb54feba" class="outline-3">
<h3 id="orgb54feba"><span class="done DONE">DONE</span> 26 - Reciprocal Cycles</h3>
<div class="outline-text-3" id="text-orgb54feba">
<ol class="org-ol">
<li>I can simulate the division method and look for cycles.</li>
<li>It feels like there is a mathematical method here
If there is are repeating part, then Sum{r*10<sup>-xi</sup>} will be the repeating part. where r is the sequence of digits and x is the length of repeating part. This is equal to r*Sum{10<sup>-xi</sup>} = r/(1-10<sup>-x</sup>). There will be 10<sup>-a</sup> factor involved, but let us ignore that for now. Thus r*10<sup>x</sup>/(999..9). So the denominator times 99&#x2026;9 must be an integer or a non-recuring fraction that doesn't interact with this recurring part.</li>
</ol>

<p>
The intuition is there, but need to put it down concretely.
I somehow worked it through with many assumptions and arrived at the correct answer.
</p>
</div>
</div>
<div id="outline-container-org97972c6" class="outline-3">
<h3 id="org97972c6"><span class="done DONE">DONE</span> 27 - Quadratic Primes</h3>
<div class="outline-text-3" id="text-org97972c6">
<ul class="org-ul">
<li>for n<sup>2</sup>+an+b to be prime from n=0, b must be a prime and, n must be below b.</li>
<li>1+a+b must also be a prime.</li>
<li><code>[(a, b) for a in (-1000:1000) for b in ps if is_prime(a+b+1)]</code> gives 39k elements</li>
<li>I have an idea to write a winner iterator. :| Turns out to be kind of bfs search.
<ul class="org-ul">
<li>There is a sequence of values, each of which might go to next step.</li>
<li>At any step if the next step fails, we remove it.</li>
<li>finally we are left with only winners</li>
<li>so we need two functions, <span class="underline">next<sub>step</sub></span>, <span class="underline">failed?</span></li>
<li>Will be useful for pruning search spaces, also for bfs traversal search if we can allow <span class="underline">next<sub>step</sub></span> to give us multiple next states.</li>
</ul></li>
</ul>

<p>
Just brute forced it, after filtering b choices to positive and primes numbers
</p>
</div>
</div>

<div id="outline-container-org9090ec2" class="outline-3">
<h3 id="org9090ec2"><span class="done DONE">DONE</span> 28 - Number Spiral Diagonals</h3>
<div class="outline-text-3" id="text-org9090ec2">
<ul class="org-ul">
<li>length of the side of squares is [1, 3, 5, &#x2026;.]</li>
<li>if length of side is n, then there are 4*(n-1) numbers on that square</li>
<li>the starting number is (n-2)<sup>2</sup>+1 and ending number is n<sup>2</sup></li>
<li>thus the diagonal numbers are (n-2)<sup>2</sup>+(n-1), (n-2)<sup>2</sup>+2(n-1), (n-2)<sup>2</sup>+3(n-1), (n-2)<sup>2</sup>+4(n-1)</li>
<li>The sum of these is 4(n-2)<sup>2</sup>+10(n-1) = 4n<sup>2</sup>-6n+6</li>
<li>we can also sum these directly as Sum(n<sup>2</sup>) and sum(n) are simple enough
<ul class="org-ul">
<li>Have to be careful on n=1, The above quadratic gives 4 as it counts 1 itself 4 times</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9d4cee5" class="outline-3">
<h3 id="org9d4cee5"><span class="done DONE">DONE</span> 29 - Distinct Powers</h3>
<div class="outline-text-3" id="text-org9d4cee5">
<p>
a<sup>b</sup> = x<sup>y</sup> and a &lt; x, then x and a are both powers of some common number.
</p>
<ul class="org-ul">
<li>we can reduce a<sup>b</sup> to an<sup>bn</sup>, where an<sup>e</sup> = a and b*e = bn and an<sup>e</sup> &lt;= ub, bn &lt;= ub
and (an, bn) is the pair with smallest <span class="underline">an</span> among all such possible pairs.</li>
<li>If a<sup>b</sup> = x<sup>y</sup>, then both of them will reduce to the same pair of numbers.</li>
<li>Now we just have to count the number of unique pairs</li>
</ul>
<p>
:) All this just to avoid brute-forcing by BigInts. That's just a one-liner.
</p>
</div>
</div>

<div id="outline-container-orgb093fe2" class="outline-3">
<h3 id="orgb093fe2"><span class="done DONE">DONE</span> 30 - Digit Fifth Powers</h3>
<div class="outline-text-3" id="text-orgb093fe2">
<p>
I need to figure out the upper bound number possible.
</p>
<ul class="org-ul">
<li>For a number with (k+1) digits, 10<sup>k</sup> is the smallest possible number and digit power sum is (k+1)*9<sup>e</sup>. Since one is exponential and one is linear, there will be an upper bound.</li>
<li>For this case 10<sup>k</sup> &gt; (k+1)*9<sup>5</sup>. for k=5, we have 10<sup>5</sup> &lt; 6*9<sup>5</sup>, but 10<sup>6</sup> &gt; 7*9<sup>5</sup>. So we need only consider upto k=5, i.e., 6digit numbers, i.e., numbers below one million.</li>

<li>a million iterations of a simple function(5 powers, 5 sums), it will run within 1sec</li>
</ul>
</div>
</div>

<div id="outline-container-orgc4c82f5" class="outline-3">
<h3 id="orgc4c82f5"><span class="done DONE">DONE</span> 31 - Coin Sums</h3>
<div class="outline-text-3" id="text-orgc4c82f5">
<p>
Change-Making Problem:: How many ways can 2 pounds(200 pences) be formed from
1p, 2p, 5p, 10p, 20p, 50p, 1P(100p), 2P(200p)
</p>
<ul class="org-ul">
<li>This can be done with combinatorics.
<ul class="org-ul">
<li>I remember doing some generating functions method to do something like this.</li>
<li>with 8 different choices, this is not a good way to get answer</li>
</ul></li>
<li>until wikipedia on <span class="underline">change making problem</span> suggested dynamic programming. I didn't even recognize this as a simple knapsack problem!</li>
<li>Brute-forcing requires going through a search space of 200*100*40*20*10*4*2 = 1<sub>280</sub><sub>000</sub><sub>000</sub>, a billion
<ul class="org-ul">
<li><p>
we can decrease this a lot by getting a combinatorial answer to (1p, 2p). Now the search space will just be 40*20*10*4*2 = 64<sub>000</sub>.
</p>
<blockquote>
<p>
julia&gt; @timev num<sub>partitions</sub><sub>with</sub>(200, [5, 10, 20, 50, 100, 200]); nothing
  0.262925 seconds (778.84 k allocations: 70.602 MiB, 76.49% gc time)
elapsed time (ns):  262924841
gc time (ns):       201122614
bytes allocated:    74031456
pool allocs:        778823
non-pool GC allocs: 11
malloc() calls:     1
realloc() calls:    2
free() calls:       2
minor collections:  0
full collections:   1
</p>
</blockquote>
<p>
Not a bad reduction. 10<sup>9</sup> search space would have taken a lot longer.
</p></li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org2fee164" class="outline-3">
<h3 id="org2fee164"><span class="done DONE">DONE</span> 32 - Pandigital Products</h3>
<div class="outline-text-3" id="text-org2fee164">
<p>
A n-digit number is pandigital if it uses all digits 1..n exactly once.
</p>
<ul class="org-ul">
<li>I might've done this before in prolog.</li>
<li>I need to find bounds for A, B, C such that A*B = C is a possible pandigital product.
<ul class="org-ul">
<li>suppose A has x+1 digits, B has y+1 digits and C has z+1 digits.
x+y+z = 6
x+y &lt; z+1
x+1+y+1 &gt; z.
So z-2 &lt; x+y &lt; z+1, ie., x+y can only be z or z+1
x+y+z can only be 2z or 2z+1 = 6. So z can only be 3.</li>
</ul></li>
<li>So should I check every divisor for every 4 digit number that has non repeating digit?</li>
</ul>
<blockquote>
<p>
julia&gt; @timev spf = smallest<sub>prime</sub><sub>factors</sub>(10<sub>000</sub>); sum(filter(x -&gt; is<sub>pandigital</sub>(x, spf), 1000:9999));nothing
  0.000591 seconds (2 allocations: 78.172 KiB)
elapsed time (ns):  591016
gc time (ns):       0
bytes allocated:    80048
pool allocs:        1
non-pool GC allocs: 0
malloc() calls:     1
free() calls:       0
minor collections:  0
full collections:   0
</p>
</blockquote>
<p>
:) less than 1ms
</p>
</div>
</div>

<div id="outline-container-orgfca6e91" class="outline-3">
<h3 id="orgfca6e91"><span class="done DONE">DONE</span> 33 - Digit Cancelling Fractions</h3>
<div class="outline-text-3" id="text-orgfca6e91">
<ul class="org-ul">
<li>multiples of 11 are trivial cases</li>
<li>foldl(*, filter(is<sub>digit</sub><sub>cancelling</sub> ,&#x2026;))</li>
</ul>
</div>
</div>


<div id="outline-container-orgb85e9b1" class="outline-3">
<h3 id="orgb85e9b1"><span class="done DONE">DONE</span> 34 - Digit Factorials</h3>
<div class="outline-text-3" id="text-orgb85e9b1">
<ul class="org-ul">
<li>Need to find bounds
<ul class="org-ul">
<li>the k digit number must be smaller than (k+1)*factorial(9)</li>
<li>the k digit number must be greater than (k+1)</li>
<li>So k &gt;= 2 and k &lt;= 7 (smallest 8 digit number is &gt; 9*factorial(9))</li>
<li>2:9<sub>999</sub><sub>999</sub></li>
</ul></li>
<li>simple brute forcing worked &lt; 2 seconds</li>
</ul>
</div>
</div>


<div id="outline-container-org40e8e23" class="outline-3">
<h3 id="org40e8e23"><span class="done DONE">DONE</span> 35 - Circular Primes</h3>
<div class="outline-text-3" id="text-org40e8e23">
<ul class="org-ul">
<li><code>NumberTheory</code> is becoming quite usefull. brute-forcing worked in &lt; 1 second</li>
<li><code>circshift</code> in julia :) made things easier</li>
</ul>
</div>
</div>
