notes.org
** DONE 36 - Double-base Palindromes

- julia has ~digits(n, base)~; nice


** DONE 37 - Truncatable Primes
- ~f(x) = x*x~ version of function definition. I didn't realize this even after writing a Base.show method previously.
- tried out the upper bound as 1 million and that gave me 11 numbers. worked on the first try :)

** DONE 38 - Pandigital Multiples
- upper bound for the integer is 9999 since atleast two of the numbers must be concatenated. If it has 5 digits, then the result will non have 9 digits in it.
- n <= 9 since anything greater than that will give result with > 9 digits in it.
- rest is brute-force search

** DONE 39 - Integer Right Triangles
x+y+z = p, (x, y, z) form a right triangle with perimeter p. Which perimeter gives the most number of right triangles? 120 gives 3 of them.
- just brute forced it. 150ms. Is there a way to do this optimally?


** DONE 40 - Champernowne's Constant
- (10-1)x1 digit numbers, (99-9)x2 digit numbers, (999-99)x3 digit numbers ...
  - 9e(a-1)xa digit numbers
- Now we figure out for each i, to which block it belongs.
- after that with (i-sum(prev_blocks))mod(digits in each number of that block) and div gives us which number and which digit of the number
Requires careful shaping of boundries.
Sighhh... that was hairy. I was lucky it worked as fast as it did.

** DONE 41 - Pandigital Prime
- Worst case scenario, a 9-digit pandigital prime exists
  + factorial(9) numbers must be checked it they are prime.
- Hmm, there are no 8 or 9-digit pandigital primes at all
  + Only 4 and 7 digit ones; curious

** DONE 42 - Triangle Coded Numbers
Feels like a AOC question.

** DONE 43 - Substring Divisibility
- cut the factorial(10) space by a factor of 10
  + d6 must be either 0 or 5
  + d4 must be even
- more optimization can be done but just this much has allowed < 1sec runtime 

** DONE 44 - Pentagon Numbers
- Pa, Pb are the pentagon numbers which give Pa+Pb=Pc and Pa-Pb=Pd;We will iterate over Pd
  + upper bound for a is (Pd-1)/3
- d is large... iterating over d is going O(n^3)
  + Iterating over a and b themselves gave me answer faster.
  + If d was small the first strategy would've given me answer faser.

** DONE 45 - Triangular, Pentagonal, Hexagonal
https://en.wikipedia.org/wiki/Polygonal_number
40755 is simultaniously all three with indices (285, 165, 143). Find the next such number
- full brute force search. < 1ms

** DONE 46 - Goldbach's Other Conjecture
- I don't see any way to optimize this :(
- 10_000 upperbound gave me the answer

** DONE 47 - Distinct Prime Factors
- again brute forcing.

** DONE 48 - Self Powers
- I'm trying to reduce this mathematically.
  + got upto a point, but I'm not sure more reduction is impossible
- I need to define modulo arithmetic for powers, mutiplication etc...
  + I'm trying to avoid BigInts
  + julia has ~invmod~ !! nice
- :( I tried going the ~invmod~ route, So that I can just sum 10 terms...
  + it did not work. invmod requires gcd be 1.
  + I just used builtin ~powermod~ and summed all 1000 terms.


** DONE 49 - Prime Permutations
- finally had to write a choice function to get k elements from a collection
  + TODO: I should rewrite this and permutations function as iterators

** DONE 50 - Consecutive Prime Sum
- consecutive sums can be made efficient by pre-computing partial sums
- For each prime p, I need to find the bounds before checking them all
- 3secs brute-force

** DONE 51 - Prime Digit Replacements
- used ~choose~ to get choices for replacement positions
- first problem with > 5% difficulty

** DONE 52 - Permuted Multiples
- used ~Set~ for comparision


** DONE 53 - Combinatoric Selections
How many values of binomial(n, r) are greater than one-million.
- C(n, r) = C(n-1, r-1) + C(n, r-1). So if any of the summands are > 1M, then the result is also.
- We can build a 100x100 array and start building it recursively.
  + forall n. C(n, 1) = n, forall k.C(k, k) = 1.
- ~count~ is nice. I just used partial application! ~count(==(10^6), ...)~. I din't even know julia had them!!!

** DONE 54 - Poker Hands
I need to map each hand to a scoring system with the following properties:
1. uniquely determinded
2. easily comparable. preferably in dictionary order.
- took a while to write the scoring system.
  + only player1 wins are accurate. The rest might be draws or player2 wins. comparision must also be done in reverse to eliminate draws.
   
** DONE 55 - lychrel numbers
https://en.wikipedia.org/wiki/Lychrel_number
Interesting a simple function can give rise to unsolved problems.
- Just simulated everything.

** DONE 56 - Powerful Digit Sum
for a, b < 100 consider numbers of the form a^b. Which of these has the largest digit sum?
- brute force it with ~LongNums~

** DONE 57 - Square root convergents
x = sqrt(2) - 1, then x = 1/(sqrt(2)+1) = 1/(2 + x). by repeatedly replacing x on the rhs with lhs, we get the continued fraction.
- x_0 = 0
- x_(n+1) = 1/(2+x_n)
- Had to make it Rational{BigInt}; overflowing otherwise

