notes.html


<div id="outline-container-org76a7e31" class="outline-3">
<h3 id="org76a7e31"><span class="done DONE">DONE</span> 36 - Double-base Palindromes</h3>
<div class="outline-text-3" id="text-org76a7e31">
<ul class="org-ul">
<li>julia has <code>digits(n, base)</code>; nice</li>
</ul>
</div>
</div>


<div id="outline-container-org9c01102" class="outline-3">
<h3 id="org9c01102"><span class="done DONE">DONE</span> 37 - Truncatable Primes</h3>
<div class="outline-text-3" id="text-org9c01102">
<ul class="org-ul">
<li><code>f(x) = x*x</code> version of function definition. I didn't realize this even after writing a Base.show method previously.</li>
<li>tried out the upper bound as 1 million and that gave me 11 numbers. worked on the first try :)</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb7ad53" class="outline-3">
<h3 id="orgdb7ad53"><span class="done DONE">DONE</span> 38 - Pandigital Multiples</h3>
<div class="outline-text-3" id="text-orgdb7ad53">
<ul class="org-ul">
<li>upper bound for the integer is 9999 since atleast two of the numbers must be concatenated. If it has 5 digits, then the result will non have 9 digits in it.</li>
<li>n &lt;= 9 since anything greater than that will give result with &gt; 9 digits in it.</li>
<li>rest is brute-force search</li>
</ul>
</div>
</div>

<div id="outline-container-org7470ef7" class="outline-3">
<h3 id="org7470ef7"><span class="done DONE">DONE</span> 39 - Integer Right Triangles</h3>
<div class="outline-text-3" id="text-org7470ef7">
<p>
x+y+z = p, (x, y, z) form a right triangle with perimeter p. Which perimeter gives the most number of right triangles? 120 gives 3 of them.
</p>
<ul class="org-ul">
<li>just brute forced it. 150ms. Is there a way to do this optimally?</li>
</ul>
</div>
</div>


<div id="outline-container-orgba7ff1f" class="outline-3">
<h3 id="orgba7ff1f"><span class="done DONE">DONE</span> 40 - Champernowne's Constant</h3>
<div class="outline-text-3" id="text-orgba7ff1f">
<ul class="org-ul">
<li>(10-1)x1 digit numbers, (99-9)x2 digit numbers, (999-99)x3 digit numbers &#x2026;
<ul class="org-ul">
<li>9e(a-1)xa digit numbers</li>
</ul></li>
<li>Now we figure out for each i, to which block it belongs.</li>
<li>after that with (i-sum(prev<sub>blocks</sub>))mod(digits in each number of that block) and div gives us which number and which digit of the number</li>
</ul>
<p>
Requires careful shaping of boundries.
Sighhh&#x2026; that was hairy. I was lucky it worked as fast as it did.
</p>
</div>
</div>

<div id="outline-container-orgdc7bff8" class="outline-3">
<h3 id="orgdc7bff8"><span class="done DONE">DONE</span> 41 - Pandigital Prime</h3>
<div class="outline-text-3" id="text-orgdc7bff8">
<ul class="org-ul">
<li>Worst case scenario, a 9-digit pandigital prime exists
<ul class="org-ul">
<li>factorial(9) numbers must be checked it they are prime.</li>
</ul></li>
<li>Hmm, there are no 8 or 9-digit pandigital primes at all
<ul class="org-ul">
<li>Only 4 and 7 digit ones; curious</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc70c17b" class="outline-3">
<h3 id="orgc70c17b"><span class="done DONE">DONE</span> 42 - Triangle Coded Numbers</h3>
<div class="outline-text-3" id="text-orgc70c17b">
<p>
Feels like a AOC question.
</p>
</div>
</div>

<div id="outline-container-org607a12c" class="outline-3">
<h3 id="org607a12c"><span class="done DONE">DONE</span> 43 - Substring Divisibility</h3>
<div class="outline-text-3" id="text-org607a12c">
<ul class="org-ul">
<li>cut the factorial(10) space by a factor of 10
<ul class="org-ul">
<li>d6 must be either 0 or 5</li>
<li>d4 must be even</li>
</ul></li>
<li>more optimization can be done but just this much has allowed &lt; 1sec runtime</li>
</ul>
</div>
</div>

<div id="outline-container-orgb2db918" class="outline-3">
<h3 id="orgb2db918"><span class="done DONE">DONE</span> 44 - Pentagon Numbers</h3>
<div class="outline-text-3" id="text-orgb2db918">
<ul class="org-ul">
<li>Pa, Pb are the pentagon numbers which give Pa+Pb=Pc and Pa-Pb=Pd;We will iterate over Pd
<ul class="org-ul">
<li>upper bound for a is (Pd-1)/3</li>
</ul></li>
<li>d is large&#x2026; iterating over d is going O(n<sup>3</sup>)
<ul class="org-ul">
<li>Iterating over a and b themselves gave me answer faster.</li>
<li>If d was small the first strategy would've given me answer faser.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org957f62b" class="outline-3">
<h3 id="org957f62b"><span class="done DONE">DONE</span> 45 - Triangular, Pentagonal, Hexagonal</h3>
<div class="outline-text-3" id="text-org957f62b">
<p>
<a href="https://en.wikipedia.org/wiki/Polygonal_number">https://en.wikipedia.org/wiki/Polygonal_number</a>
40755 is simultaniously all three with indices (285, 165, 143). Find the next such number
</p>
<ul class="org-ul">
<li>full brute force search. &lt; 1ms</li>
</ul>
</div>
</div>

<div id="outline-container-org2d18fda" class="outline-3">
<h3 id="org2d18fda"><span class="done DONE">DONE</span> 46 - Goldbach's Other Conjecture</h3>
<div class="outline-text-3" id="text-org2d18fda">
<ul class="org-ul">
<li>I don't see any way to optimize this :(</li>
<li>10<sub>000</sub> upperbound gave me the answer</li>
</ul>
</div>
</div>

<div id="outline-container-orgb292447" class="outline-3">
<h3 id="orgb292447"><span class="done DONE">DONE</span> 47 - Distinct Prime Factors</h3>
<div class="outline-text-3" id="text-orgb292447">
<ul class="org-ul">
<li>again brute forcing.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfd8eeee" class="outline-3">
<h3 id="orgfd8eeee"><span class="done DONE">DONE</span> 48 - Self Powers</h3>
<div class="outline-text-3" id="text-orgfd8eeee">
<ul class="org-ul">
<li>I'm trying to reduce this mathematically.
<ul class="org-ul">
<li>got upto a point, but I'm not sure more reduction is impossible</li>
</ul></li>
<li>I need to define modulo arithmetic for powers, mutiplication etc&#x2026;
<ul class="org-ul">
<li>I'm trying to avoid BigInts</li>
<li>julia has <code>invmod</code> !! nice</li>
</ul></li>
<li>:( I tried going the <code>invmod</code> route, So that I can just sum 10 terms&#x2026;
<ul class="org-ul">
<li>it did not work. invmod requires gcd be 1.</li>
<li>I just used builtin <code>powermod</code> and summed all 1000 terms.</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orgb9b16b3" class="outline-3">
<h3 id="orgb9b16b3"><span class="done DONE">DONE</span> 49 - Prime Permutations</h3>
<div class="outline-text-3" id="text-orgb9b16b3">
<ul class="org-ul">
<li>finally had to write a choice function to get k elements from a collection
<ul class="org-ul">
<li>TODO: I should rewrite this and permutations function as iterators</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7c0007b" class="outline-3">
<h3 id="org7c0007b"><span class="done DONE">DONE</span> 50 - Consecutive Prime Sum</h3>
<div class="outline-text-3" id="text-org7c0007b">
<ul class="org-ul">
<li>consecutive sums can be made efficient by pre-computing partial sums</li>
<li>For each prime p, I need to find the bounds before checking them all</li>
<li>3secs brute-force</li>
</ul>
</div>
</div>

<div id="outline-container-org1834ea2" class="outline-3">
<h3 id="org1834ea2"><span class="done DONE">DONE</span> 51 - Prime Digit Replacements</h3>
<div class="outline-text-3" id="text-org1834ea2">
<ul class="org-ul">
<li>used <code>choose</code> to get choices for replacement positions</li>
<li>first problem with &gt; 5% difficulty</li>
</ul>
</div>
</div>

<div id="outline-container-org98af494" class="outline-3">
<h3 id="org98af494"><span class="done DONE">DONE</span> 52 - Permuted Multiples</h3>
<div class="outline-text-3" id="text-org98af494">
<ul class="org-ul">
<li>used <code>Set</code> for comparision</li>
</ul>
</div>
</div>


<div id="outline-container-org88c866a" class="outline-3">
<h3 id="org88c866a"><span class="done DONE">DONE</span> 53 - Combinatoric Selections</h3>
<div class="outline-text-3" id="text-org88c866a">
<p>
How many values of binomial(n, r) are greater than one-million.
</p>
<ul class="org-ul">
<li>C(n, r) = C(n-1, r-1) + C(n, r-1). So if any of the summands are &gt; 1M, then the result is also.</li>
<li>We can build a 100x100 array and start building it recursively.
<ul class="org-ul">
<li>forall n. C(n, 1) = n, forall k.C(k, k) = 1.</li>
</ul></li>
<li><code>count</code> is nice. I just used partial application! <code>count(==(10^6), ...)</code>. I din't even know julia had them!!!</li>
</ul>
</div>
</div>

<div id="outline-container-org2513696" class="outline-3">
<h3 id="org2513696"><span class="done DONE">DONE</span> 54 - Poker Hands</h3>
<div class="outline-text-3" id="text-org2513696">
<p>
I need to map each hand to a scoring system with the following properties:
</p>
<ol class="org-ol">
<li>uniquely determinded</li>
<li>easily comparable. preferably in dictionary order.</li>
<li>took a while to write the scoring system.
<ul class="org-ul">
<li>only player1 wins are accurate. The rest might be draws or player2 wins. comparision must also be done in reverse to eliminate draws.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org4f9edd0" class="outline-3">
<h3 id="org4f9edd0"><span class="done DONE">DONE</span> 55 - lychrel numbers</h3>
<div class="outline-text-3" id="text-org4f9edd0">
<p>
<a href="https://en.wikipedia.org/wiki/Lychrel_number">https://en.wikipedia.org/wiki/Lychrel_number</a>
Interesting a simple function can give rise to unsolved problems.
</p>
<ul class="org-ul">
<li>Just simulated everything.</li>
</ul>
</div>
</div>

<div id="outline-container-org6cabcdc" class="outline-3">
<h3 id="org6cabcdc"><span class="done DONE">DONE</span> 56 - Powerful Digit Sum</h3>
<div class="outline-text-3" id="text-org6cabcdc">
<p>
for a, b &lt; 100 consider numbers of the form a<sup>b</sup>. Which of these has the largest digit sum?
</p>
<ul class="org-ul">
<li>brute force it with <code>LongNums</code></li>
</ul>
</div>
</div>

<div id="outline-container-orge62365f" class="outline-3">
<h3 id="orge62365f"><span class="done DONE">DONE</span> 57 - Square root convergents</h3>
<div class="outline-text-3" id="text-orge62365f">
<p>
x = sqrt(2) - 1, then x = 1/(sqrt(2)+1) = 1/(2 + x). by repeatedly replacing x on the rhs with lhs, we get the continued fraction.
</p>
<ul class="org-ul">
<li>x<sub>0</sub> = 0</li>
<li>x<sub>(n+1)</sub> = 1/(2+x<sub>n</sub>)</li>
<li>Had to make it Rational{BigInt}; overflowing otherwise</li>
</ul>
</div>
</div>
