notes.org
** DONE 58 - Spiral Primes
I've already seen this in [[*28 - Number Spiral Diagonals][28 - Number Spiral Diagonals]].
- now just have to filter primes
- taking too long. even 5000 layer is still not < 10%, i.e., primes upto 25 million.
- for 1000 layers, I have 13.8%
This problem is 5% difficulty, so thinking that I have missed something obvious, I searched for hints online. A few that I looked at just brute forced them using miller-rabin primality test.
- I thought may be I should finally implement an advanced primality test, but then I came across https://en.wikipedia.org/wiki/Primality_test#Number-theoretic_methods
- for all diagonal numbers n, n-1 is easily factorizable.
- So I implemented lucas primality test. https://en.wikipedia.org/wiki/Lucas_primality_test

** DONE 59 - Xor Decryption
- I tried searching for _the _ for 26^3 possible keys.
- Only 6 keys gave plain text that have it.
- Looking at them only one had sensible starting words

** TODO 60 - Prime Pair Sets                            :clique:subgraph:d20:
- Seems like I will be using lots of ~Combinatorics~
- simple brute force is taking too long...
- I first filtered all primes that can be split into primes that can be reverse combined to a new prime.
  + Every pair from the required set will be in this.
  + Now how do I get the required set??? We have a graph in which we need a five nodes that are all connected to each other, i.e, find the complete 5 node subgraph.
  + I should draw the graph and see how it looks, there seem to be atmost 71 edges for 10^4 upperbound.
  + It is still taking too long. How the hell can I get this in <1sec

** DONE 61 - Cyclical Figurate Numbers
Cyclic set of 4-digit numbers:: last two digits of one number are first two digits of the other number; last number and the first form a pair.
Find the sum of only ordered set of six cyclic 4-digit numbers for which each polygonal type([3, 4, 5, 6, 7, 8]) is represented.
- there are 9000 4 digit numbers. binomial(9000, 4) ~ 10^21; full brute search is impossible
- there are less than 100 4-digit triangual numbers. One of them must be in the set.
  + for every number we check if another figurate number with starting two digits exists, if does we keep going.
  + Hmm, we will be essentially doing backtracking.
  + There are only 40 4-digit octagonal numbers; so it is better to start with those.
- I first created a graph.
  + nodes are all _for in 3:8, (i, f(i, n))_, i.e, tuples of all figurate numbers
  + there is a directed edge between two nodes if last two digits of one number are first two digits of other and they are different figurate types
  + In this graph, I need to find cycles of length 6 such that all nodes have different figurate types.
  + I din't find any cycles of length 6, only those from 2:5
    * Haaa, this is just dfs search for a first cycle. It did not represent all cycles.

  + I need to find all figurate unique paths b/w nodes
  + Finding all paths still did not work. :(
  + Figured it out, my copy of visited and unique is not getting refreshed b/w different paths of the same vertices. So it is only working for one path.
:) My first 20% difficulty problem
I need to write a algorithms library. Seems like I'm going to need them from now.

** DONE 62 - Cubic Permutations
Find the smallest cube for which exactly five permutations of its digits are cube.
- full brute search for a set of three permutations in a three digit range is taking > 37seconds
- if x^3 and y^3 are digit permutations of each other, then they must have same number of digits, i.e., (x/y)^3 < 10. So for every number x, we check the range [x+1, x*10^(1/3)] for numbers whose cubes are digit factorials of x^3.
  + If we find 4 other such numbers we have the answer.
  + I found 2 such solutions in 1000:9999 range.

** DONE 63 - Powerful Digit Counts
How many n-digit positive integers exists which are also nth power of a digit.
- +I assume we are not including 1:9 which trivialy satisfy this.+ we are!!
- 1^1 = 1, so should 1 be included in solution?
- 10^(n-1) =< x == d^n < 10^n
  + n-1 < log x < n imples n-1/n < log d < 1 imples n < 1/(1-log d)
  + If we take floor(1/(1-log10(d))) then we have a number of powers of digit d, that are of same digit-length of exponent.

** DONE 64 - Odd Period Square Roots
there is a recurrence relation, b/w a_i and x,y in (sqrt(N) - x)/y.
We start with x=0, y=0. When we finally end up with a same (x, y) the period will be determined.

Wow, this was tricky to get it right.
- I defined a transition b/w two terms (t, t1) of type (a*sqrt(N) - b)/c.
  - t = k + 1/t1; if t is represented by (a, b, c) then t1 will be (ac, x, a*a*N-b*b) where x has a tricky definition.
  - Now I have to continue this transitions untill the state (a, b, c) repeats
I looked in the forum and there are many simpler ways to do this. By going a more generic route, I seem to have complicated things for myself again!!

** DONE 65 - Convergents of e
Julia might make it easy with rational support.
- I had to use Rational{BigInt}, but julia made things very easy.

** DONE 66 - Diophantine Equation                            :pells_equation:
https://en.wikipedia.org/wiki/Chakravala_method
Heuristics to work with chakravala method seems hard to code.
I did a continued fraction representation in 64, so that might be the easier route to take.
Wiki says, (h_i, k_i) is a solution to \( x^2-ny^2\) where \(\dfrac{h_i}{k_i}\) is a convergent to the regular continued fraction of \(\sqrt{n}\).
combined with wikipedia formula on continued fraction convergent gives:
\begin{gather}
  \text{The fundamental solution }(x_1, y_1) =
  \begin{cases}
    (h_{p-1}, k_{p-1}), \text{for p even} \\
    (h_{2p-1}, k_{2p-1}), \text{for p odd}
  \end{cases} \\
  \dfrac{h_n}{k_n} = [a_0; a_1, ..., a_n] \\
  \begin{bmatrix}
    h_n & h_{n-1} \\ k_n & k_{n-1}
  \end{bmatrix}
  =
  \begin{bmatrix}
    a_0 & 1 \\ 1 & 0
  \end{bmatrix}
  ...
  \begin{bmatrix}
    a_n & 1 \\ 1 & 0
  \end{bmatrix}
\end{gather}

** DONE 67 - Maximum Path Sum II
Same solution as problem 18.

