notes.html

<div id="outline-container-org033dce3" class="outline-3">
<h3 id="org033dce3"><span class="done DONE">DONE</span> 58 - Spiral Primes</h3>
<div class="outline-text-3" id="text-org033dce3">
<p>
I've already seen this in <a href="#org9090ec2">28 - Number Spiral Diagonals</a>.
</p>
<ul class="org-ul">
<li>now just have to filter primes</li>
<li>taking too long. even 5000 layer is still not &lt; 10%, i.e., primes upto 25 million.</li>
<li>for 1000 layers, I have 13.8%</li>
</ul>
<p>
This problem is 5% difficulty, so thinking that I have missed something obvious, I searched for hints online. A few that I looked at just brute forced them using miller-rabin primality test.
</p>
<ul class="org-ul">
<li>I thought may be I should finally implement an advanced primality test, but then I came across <a href="https://en.wikipedia.org/wiki/Primality_test#Number-theoretic_methods">https://en.wikipedia.org/wiki/Primality_test#Number-theoretic_methods</a></li>
<li>for all diagonal numbers n, n-1 is easily factorizable.</li>
<li>So I implemented lucas primality test. <a href="https://en.wikipedia.org/wiki/Lucas_primality_test">https://en.wikipedia.org/wiki/Lucas_primality_test</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgde10cd8" class="outline-3">
<h3 id="orgde10cd8"><span class="done DONE">DONE</span> 59 - Xor Decryption</h3>
<div class="outline-text-3" id="text-orgde10cd8">
<ul class="org-ul">
<li>I tried searching for _the _ for 26<sup>3</sup> possible keys.</li>
<li>Only 6 keys gave plain text that have it.</li>
<li>Looking at them only one had sensible starting words</li>
</ul>
</div>
</div>

<div id="outline-container-org5b9e637" class="outline-3">
<h3 id="org5b9e637"><span class="todo TODO">TODO</span> 60 - Prime Pair Sets&#xa0;&#xa0;&#xa0;<span class="tag"><span class="clique">clique</span>&#xa0;<span class="subgraph">subgraph</span>&#xa0;<span class="d20">d20</span></span></h3>
<div class="outline-text-3" id="text-org5b9e637">
<ul class="org-ul">
<li>Seems like I will be using lots of <code>Combinatorics</code></li>
<li>simple brute force is taking too long&#x2026;</li>
<li>I first filtered all primes that can be split into primes that can be reverse combined to a new prime.
<ul class="org-ul">
<li>Every pair from the required set will be in this.</li>
<li>Now how do I get the required set??? We have a graph in which we need a five nodes that are all connected to each other, i.e, find the complete 5 node subgraph.</li>
<li>I should draw the graph and see how it looks, there seem to be atmost 71 edges for 10<sup>4</sup> upperbound.</li>
<li>It is still taking too long. How the hell can I get this in &lt;1sec</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb1a1e93" class="outline-3">
<h3 id="orgb1a1e93"><span class="done DONE">DONE</span> 61 - Cyclical Figurate Numbers</h3>
<div class="outline-text-3" id="text-orgb1a1e93">
<p>
Cyclic set of 4-digit numbers:: last two digits of one number are first two digits of the other number; last number and the first form a pair.
Find the sum of only ordered set of six cyclic 4-digit numbers for which each polygonal type([3, 4, 5, 6, 7, 8]) is represented.
</p>
<ul class="org-ul">
<li>there are 9000 4 digit numbers. binomial(9000, 4) ~ 10<sup>21</sup>; full brute search is impossible</li>
<li>there are less than 100 4-digit triangual numbers. One of them must be in the set.
<ul class="org-ul">
<li>for every number we check if another figurate number with starting two digits exists, if does we keep going.</li>
<li>Hmm, we will be essentially doing backtracking.</li>
<li>There are only 40 4-digit octagonal numbers; so it is better to start with those.</li>
</ul></li>
<li>I first created a graph.
<ul class="org-ul">
<li>nodes are all <span class="underline">for in 3:8, (i, f(i, n))</span>, i.e, tuples of all figurate numbers</li>
<li>there is a directed edge between two nodes if last two digits of one number are first two digits of other and they are different figurate types</li>
<li>In this graph, I need to find cycles of length 6 such that all nodes have different figurate types.</li>
<li>I din't find any cycles of length 6, only those from 2:5
<ul class="org-ul">
<li>Haaa, this is just dfs search for a first cycle. It did not represent all cycles.</li>
</ul></li>

<li>I need to find all figurate unique paths b/w nodes</li>
<li>Finding all paths still did not work. :(</li>
<li>Figured it out, my copy of visited and unique is not getting refreshed b/w different paths of the same vertices. So it is only working for one path.</li>
</ul></li>
</ul>
<p>
:) My first 20% difficulty problem
I need to write a algorithms library. Seems like I'm going to need them from now.
</p>
</div>
</div>

<div id="outline-container-orga475e7a" class="outline-3">
<h3 id="orga475e7a"><span class="done DONE">DONE</span> 62 - Cubic Permutations</h3>
<div class="outline-text-3" id="text-orga475e7a">
<p>
Find the smallest cube for which exactly five permutations of its digits are cube.
</p>
<ul class="org-ul">
<li>full brute search for a set of three permutations in a three digit range is taking &gt; 37seconds</li>
<li>if x<sup>3</sup> and y<sup>3</sup> are digit permutations of each other, then they must have same number of digits, i.e., (x/y)<sup>3</sup> &lt; 10. So for every number x, we check the range [x+1, x*10<sup>(1/3)</sup>] for numbers whose cubes are digit factorials of x<sup>3</sup>.
<ul class="org-ul">
<li>If we find 4 other such numbers we have the answer.</li>
<li>I found 2 such solutions in 1000:9999 range.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2d217e5" class="outline-3">
<h3 id="org2d217e5"><span class="done DONE">DONE</span> 63 - Powerful Digit Counts</h3>
<div class="outline-text-3" id="text-org2d217e5">
<p>
How many n-digit positive integers exists which are also nth power of a digit.
</p>
<ul class="org-ul">
<li><del>I assume we are not including 1:9 which trivialy satisfy this.</del> we are!!</li>
<li>1<sup>1</sup> = 1, so should 1 be included in solution?</li>
<li>10<sup>(n-1)</sup> <code>&lt; x =</code> d<sup>n</sup> &lt; 10<sup>n</sup>
<ul class="org-ul">
<li>n-1 &lt; log x &lt; n imples n-1/n &lt; log d &lt; 1 imples n &lt; 1/(1-log d)</li>
<li>If we take floor(1/(1-log10(d))) then we have a number of powers of digit d, that are of same digit-length of exponent.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9b760f5" class="outline-3">
<h3 id="org9b760f5"><span class="done DONE">DONE</span> 64 - Odd Period Square Roots</h3>
<div class="outline-text-3" id="text-org9b760f5">
<p>
there is a recurrence relation, b/w a<sub>i</sub> and x,y in (sqrt(N) - x)/y.
We start with x=0, y=0. When we finally end up with a same (x, y) the period will be determined.
</p>

<p>
Wow, this was tricky to get it right.
</p>
<ul class="org-ul">
<li>I defined a transition b/w two terms (t, t1) of type (a*sqrt(N) - b)/c.
<ul class="org-ul">
<li>t = k + 1/t1; if t is represented by (a, b, c) then t1 will be (ac, x, a*a*N-b*b) where x has a tricky definition.</li>
<li>Now I have to continue this transitions untill the state (a, b, c) repeats</li>
</ul></li>
</ul>
<p>
I looked in the forum and there are many simpler ways to do this. By going a more generic route, I seem to have complicated things for myself again!!
</p>
</div>
</div>

<div id="outline-container-orgc9cad94" class="outline-3">
<h3 id="orgc9cad94"><span class="done DONE">DONE</span> 65 - Convergents of e</h3>
<div class="outline-text-3" id="text-orgc9cad94">
<p>
Julia might make it easy with rational support.
</p>
<ul class="org-ul">
<li>I had to use Rational{BigInt}, but julia made things very easy.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf929977" class="outline-3">
<h3 id="orgf929977"><span class="done DONE">DONE</span> 66 - Diophantine Equation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="pells_equation">pells_equation</span></span></h3>
<div class="outline-text-3" id="text-orgf929977">
<p>
<a href="https://en.wikipedia.org/wiki/Chakravala_method">https://en.wikipedia.org/wiki/Chakravala_method</a>
Heuristics to work with chakravala method seems hard to code.
I did a continued fraction representation in 64, so that might be the easier route to take.
Wiki says, (h<sub>i</sub>, k<sub>i</sub>) is a solution to \( x^2-ny^2\) where \(\dfrac{h_i}{k_i}\) is a convergent to the regular continued fraction of \(\sqrt{n}\).
combined with wikipedia formula on continued fraction convergent gives:
</p>
\begin{gather}
  \text{The fundamental solution }(x_1, y_1) =
  \begin{cases}
    (h_{p-1}, k_{p-1}), \text{for p even} \\
    (h_{2p-1}, k_{2p-1}), \text{for p odd}
  \end{cases} \\
  \dfrac{h_n}{k_n} = [a_0; a_1, ..., a_n] \\
  \begin{bmatrix}
    h_n & h_{n-1} \\ k_n & k_{n-1}
  \end{bmatrix}
  =
  \begin{bmatrix}
    a_0 & 1 \\ 1 & 0
  \end{bmatrix}
  ...
  \begin{bmatrix}
    a_n & 1 \\ 1 & 0
  \end{bmatrix}
\end{gather}
</div>
</div>

<div id="outline-container-orga9d1e51" class="outline-3">
<h3 id="orga9d1e51"><span class="done DONE">DONE</span> 67 - Maximum Path Sum II</h3>
<div class="outline-text-3" id="text-orga9d1e51">
<p>
Same solution as problem 18.
</p>
</div>
</div>
