notes.org
** DONE 68 - Magic 5-gon Ring                           :graphics_unfinished:
I transformed this into a graph problem.
- find all possible values for the sum = 1+2+3 -> 6+5+4, i.e., n=[6,15], fix n.
- find all triples (x, y, z) that sum upto n.
- create a graph with nodes as those triples, and edges b/w nodes that have a common number in the triples, label for that edge is the common number.
- find a k-cycle(for k-gon) with disinct edge labels. This gives a magic k-gon.
- [ ] Might be a nice idea to draw a graphviz, or even better a _magic_ looking 5-gon for each one found. Maybe try a custom svg with style sheets(never did that).
- there are a total of 12 magic 5-gons. I need to convert my representation of them into strings required by the question
- only 4 are of length 16
- making sure the cycle is valid, and getting the solution string from the graph representation took too long.

** DONE 69 - Totient Maximum
find the value of n <= 10^6 for which n/phi(n) is maximum.
- ~totient~ added to ~NumberTheory~. direct calculation after prime factorization.
- rest is just foldl to find the maximum
I just did it on the repl, I forgot to write a script.

** DONE 70 - Totient Permutation
- just brute forced it.
- did not run < 1sec.
- there must be a smarter way to do i.

I just looked at the forum and there is a smarter way to do it.

 phi(n)/n = Product{forall p|n}(1-1/p), so for every new prime, the value of phi(n)/n becomes smaller, so we need as few prime factors as possible. If only one prime factor exists, then it will not be a digit permutation. So we search for prime pairs, that give us a digit permutation.

 
** DONE 71 - Ordered Fractions
- n/d < 3/7 implies 7n < 3d so if 7n+1 = 3d, then we get the nearest???
  + 7n+1 = 3d, for d < 10^6 and maximize n
  + (_, 999997) was the solution with maximal n
- Yes we did, I was quite close to the decimal approx. ~round((3/7)*10^6)~ which I tried first.

** DONE 72 - Counting Fractions
How many elements are in the set of proper fractions (n/d) for d < 10^6.

- there are (N-1)^2 pairs to form fractions with.
- some of them form equivalent pairs; when gcd(n, d) > 1.
- So for every d, we have phi(d) proper fractions; so the answer is sum(phi(d))
- ~sum(i -> totient(i, spf_vec), 2:10^6)~

** DONE 73 - Counting Fractions in a Range
- 1/3 < n/d < 1/2 implies 2d < 6n < 3d implies 6n is in [2d+1:3d-1]
- the above will give me all fractions but there will multiple equivalent ones; so I need to ignore n's that are not prime to d.

** DONE 74 - Digit Factorial Chains
- I created an array of transitions, i -> digit_factorial(i)
  + I had to traverse these transitions to ensure that all are filled; some go above the upperbound
- chains can be found by simple ~x = a[x]~ loop
- 3.5secs; I could get this down if I don't actually keep building the chains

** DONE 75 - Singular Integer Right Triangles
- generate pythagorean triples for each length l.
  + If this is a O(1) operation, then 1.5E6 can be done within 1sec.
- for m > n > 0, (m^2-n^2, 2mn, m^2+n^2) is a triple; length = 2m(m+n)
  + there can only be one way the input length l factorized into 2ab with a < b < 2a
- This will only give primitive triples -- if m, n above are coprime -- so we need add all multiples of a primitive l below the upperbound too.
- my solution took 36 seconds
  + ~divisors~ for each number and ~spf_vec~ for 1.5 million numbers should be taking quite a chuck of that.
    * Hmm, spf_vec for 1.5M takes < 1sec
    * I profiled it, ~divisors~ itself is taking most of the time trying out all combinations. I should rewrite that sometime.

** DONE 76 - Counting Summations                                  :partition:
https://en.wikipedia.org/wiki/Integer_partition
- I implemented the recurrence relation(from wiki) the builds upto the required answer

** DONE 77 - Prime Summations                                 :partition:d25:
Partition using only primes. Find the first number that can be written as a sum of primes in > 5000 different ways.
\begin{gather}
sopf(n) = \sum_{p\in\mathbb{P}, p|n}p \\
\kappa(n)=\frac{1}{n}(sopf(n)+\sum_{j=1}^{n−1}sopf(j)\kappa(n - j))
\end{gather}
The above equation is taken from math.stackexchange site, that discusses prime partitions. I'm not sure how it was derived.

If a(n, k) is the number of prime summations of n, using only primes below k, then:
\begin{equation}
a(n, k) = 
\begin{cases}
  a(n, k-1) & \text{if } k \not\in \mathbb{P} \\
  a(n-k, k) + a(n, k-1) & \text{if } k \in \mathbb{P}
\end{cases}
\end{equation}
This worked... had a bit of help from here https://oeis.org/A000607

** DONE 78 - Coin Partitions                                  :partition:d30:
find the least value of n for which 10^6|p(n).
I modified the partitions code for problem 76, to only calculate the values modulo 10^6. This way we do not have to calculate large numbers. We just have to keep going until we find a _n_ such that $p(n) \equiv 0 \mod 10^6$.
** DONE 79 - Passcode Derivation
- if xyz is a login attempt, then indices i_x < i_y < i_z (in original pass and logs)
- if we assume all the characters in password are unique, then we can simple score each character with the number of characters smaller than it and we can obtain, all possible passwords.
- but if we have instances were: i_x < i_y in one attempt and i_y < i_x in another, then either x or y needs to occur multiple times in the password.
- thankfully, this was a easy version of the problem. multiplicity would make this tough.
  + each digit was used only once, so if we collect all digits to the right of each digit, then the last one will have no digits to the right of it.
  + so we can recursively build the password from the right.

