notes.html

<div id="outline-container-orgcb60846" class="outline-3">
<h3 id="orgcb60846"><span class="done DONE">DONE</span> 68 - Magic 5-gon Ring&#xa0;&#xa0;&#xa0;<span class="tag"><span class="graphics_unfinished">graphics_unfinished</span></span></h3>
<div class="outline-text-3" id="text-orgcb60846">
<p>
I transformed this into a graph problem.
</p>
<ul class="org-ul">
<li>find all possible values for the sum = 1+2+3 -&gt; 6+5+4, i.e., n=[6,15], fix n.</li>
<li>find all triples (x, y, z) that sum upto n.</li>
<li>create a graph with nodes as those triples, and edges b/w nodes that have a common number in the triples, label for that edge is the common number.</li>
<li>find a k-cycle(for k-gon) with disinct edge labels. This gives a magic k-gon.</li>
<li class="off"><code>[&#xa0;]</code> Might be a nice idea to draw a graphviz, or even better a <span class="underline">magic</span> looking 5-gon for each one found. Maybe try a custom svg with style sheets(never did that).</li>
<li>there are a total of 12 magic 5-gons. I need to convert my representation of them into strings required by the question</li>
<li>only 4 are of length 16</li>
<li>making sure the cycle is valid, and getting the solution string from the graph representation took too long.</li>
</ul>
</div>
</div>

<div id="outline-container-org15cf5ff" class="outline-3">
<h3 id="org15cf5ff"><span class="done DONE">DONE</span> 69 - Totient Maximum</h3>
<div class="outline-text-3" id="text-org15cf5ff">
<p>
find the value of n &lt;= 10<sup>6</sup> for which n/phi(n) is maximum.
</p>
<ul class="org-ul">
<li><code>totient</code> added to <code>NumberTheory</code>. direct calculation after prime factorization.</li>
<li>rest is just foldl to find the maximum</li>
</ul>
<p>
I just did it on the repl, I forgot to write a script.
</p>
</div>
</div>

<div id="outline-container-org9c31c7e" class="outline-3">
<h3 id="org9c31c7e"><span class="done DONE">DONE</span> 70 - Totient Permutation</h3>
<div class="outline-text-3" id="text-org9c31c7e">
<ul class="org-ul">
<li>just brute forced it.</li>
<li>did not run &lt; 1sec.</li>
<li>there must be a smarter way to do i.</li>
</ul>

<p>
I just looked at the forum and there is a smarter way to do it.
</p>

<p>
phi(n)/n = Product{forall p|n}(1-1/p), so for every new prime, the value of phi(n)/n becomes smaller, so we need as few prime factors as possible. If only one prime factor exists, then it will not be a digit permutation. So we search for prime pairs, that give us a digit permutation.
</p>
</div>
</div>


<div id="outline-container-org39a7e34" class="outline-3">
<h3 id="org39a7e34"><span class="done DONE">DONE</span> 71 - Ordered Fractions</h3>
<div class="outline-text-3" id="text-org39a7e34">
<ul class="org-ul">
<li>n/d &lt; 3/7 implies 7n &lt; 3d so if 7n+1 = 3d, then we get the nearest???
<ul class="org-ul">
<li>7n+1 = 3d, for d &lt; 10<sup>6</sup> and maximize n</li>
<li>(_, 999997) was the solution with maximal n</li>
</ul></li>
<li>Yes we did, I was quite close to the decimal approx. <code>round((3/7)*10^6)</code> which I tried first.</li>
</ul>
</div>
</div>

<div id="outline-container-org6a2684d" class="outline-3">
<h3 id="org6a2684d"><span class="done DONE">DONE</span> 72 - Counting Fractions</h3>
<div class="outline-text-3" id="text-org6a2684d">
<p>
How many elements are in the set of proper fractions (n/d) for d &lt; 10<sup>6</sup>.
</p>

<ul class="org-ul">
<li>there are (N-1)<sup>2</sup> pairs to form fractions with.</li>
<li>some of them form equivalent pairs; when gcd(n, d) &gt; 1.</li>
<li>So for every d, we have phi(d) proper fractions; so the answer is sum(phi(d))</li>
<li><code>sum(i -&gt; totient(i, spf_vec), 2:10^6)</code></li>
</ul>
</div>
</div>

<div id="outline-container-org8e563c0" class="outline-3">
<h3 id="org8e563c0"><span class="done DONE">DONE</span> 73 - Counting Fractions in a Range</h3>
<div class="outline-text-3" id="text-org8e563c0">
<ul class="org-ul">
<li>1/3 &lt; n/d &lt; 1/2 implies 2d &lt; 6n &lt; 3d implies 6n is in [2d+1:3d-1]</li>
<li>the above will give me all fractions but there will multiple equivalent ones; so I need to ignore n's that are not prime to d.</li>
</ul>
</div>
</div>

<div id="outline-container-org67eaa9c" class="outline-3">
<h3 id="org67eaa9c"><span class="done DONE">DONE</span> 74 - Digit Factorial Chains</h3>
<div class="outline-text-3" id="text-org67eaa9c">
<ul class="org-ul">
<li>I created an array of transitions, i -&gt; digit<sub>factorial</sub>(i)
<ul class="org-ul">
<li>I had to traverse these transitions to ensure that all are filled; some go above the upperbound</li>
</ul></li>
<li>chains can be found by simple <code>x = a[x]</code> loop</li>
<li>3.5secs; I could get this down if I don't actually keep building the chains</li>
</ul>
</div>
</div>

<div id="outline-container-orgde86893" class="outline-3">
<h3 id="orgde86893"><span class="done DONE">DONE</span> 75 - Singular Integer Right Triangles</h3>
<div class="outline-text-3" id="text-orgde86893">
<ul class="org-ul">
<li>generate pythagorean triples for each length l.
<ul class="org-ul">
<li>If this is a O(1) operation, then 1.5E6 can be done within 1sec.</li>
</ul></li>
<li>for m &gt; n &gt; 0, (m<sup>2</sup>-n<sup>2</sup>, 2mn, m<sup>2</sup>+n<sup>2</sup>) is a triple; length = 2m(m+n)
<ul class="org-ul">
<li>there can only be one way the input length l factorized into 2ab with a &lt; b &lt; 2a</li>
</ul></li>
<li>This will only give primitive triples &#x2013; if m, n above are coprime &#x2013; so we need add all multiples of a primitive l below the upperbound too.</li>
<li>my solution took 36 seconds
<ul class="org-ul">
<li><code>divisors</code> for each number and <code>spf_vec</code> for 1.5 million numbers should be taking quite a chuck of that.
<ul class="org-ul">
<li>Hmm, spf<sub>vec</sub> for 1.5M takes &lt; 1sec</li>
<li>I profiled it, <code>divisors</code> itself is taking most of the time trying out all combinations. I should rewrite that sometime.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgfafca99" class="outline-3">
<h3 id="orgfafca99"><span class="done DONE">DONE</span> 76 - Counting Summations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="partition">partition</span></span></h3>
<div class="outline-text-3" id="text-orgfafca99">
<p>
<a href="https://en.wikipedia.org/wiki/Integer_partition">https://en.wikipedia.org/wiki/Integer_partition</a>
</p>
<ul class="org-ul">
<li>I implemented the recurrence relation(from wiki) the builds upto the required answer</li>
</ul>
</div>
</div>

<div id="outline-container-orgd376786" class="outline-3">
<h3 id="orgd376786"><span class="done DONE">DONE</span> 77 - Prime Summations&#xa0;&#xa0;&#xa0;<span class="tag"><span class="partition">partition</span>&#xa0;<span class="d25">d25</span></span></h3>
<div class="outline-text-3" id="text-orgd376786">
<p>
Partition using only primes. Find the first number that can be written as a sum of primes in &gt; 5000 different ways.
</p>
\begin{gather}
sopf(n) = \sum_{p\in\mathbb{P}, p|n}p \\
\kappa(n)=\frac{1}{n}(sopf(n)+\sum_{j=1}^{n−1}sopf(j)\kappa(n - j))
\end{gather}
<p>
The above equation is taken from math.stackexchange site, that discusses prime partitions. I'm not sure how it was derived.
</p>

<p>
If a(n, k) is the number of prime summations of n, using only primes below k, then:
</p>
\begin{equation}
a(n, k) = 
\begin{cases}
  a(n, k-1) & \text{if } k \not\in \mathbb{P} \\
  a(n-k, k) + a(n, k-1) & \text{if } k \in \mathbb{P}
\end{cases}
\end{equation}
<p>
This worked&#x2026; had a bit of help from here <a href="https://oeis.org/A000607">https://oeis.org/A000607</a>
</p>
</div>
</div>

<div id="outline-container-orgba6aacd" class="outline-3">
<h3 id="orgba6aacd"><span class="done DONE">DONE</span> 78 - Coin Partitions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="partition">partition</span>&#xa0;<span class="d30">d30</span></span></h3>
<div class="outline-text-3" id="text-orgba6aacd">
<p>
find the least value of n for which 10<sup>6</sup>|p(n).
I modified the partitions code for problem 76, to only calculate the values modulo 10<sup>6</sup>. This way we do not have to calculate large numbers. We just have to keep going until we find a <span class="underline">n</span> such that \(p(n) \equiv 0 \mod 10^6\).
</p>
</div>
</div>
<div id="outline-container-org4f9dcfa" class="outline-3">
<h3 id="org4f9dcfa"><span class="done DONE">DONE</span> 79 - Passcode Derivation</h3>
<div class="outline-text-3" id="text-org4f9dcfa">
<ul class="org-ul">
<li>if xyz is a login attempt, then indices i<sub>x</sub> &lt; i<sub>y</sub> &lt; i<sub>z</sub> (in original pass and logs)</li>
<li>if we assume all the characters in password are unique, then we can simple score each character with the number of characters smaller than it and we can obtain, all possible passwords.</li>
<li>but if we have instances were: i<sub>x</sub> &lt; i<sub>y</sub> in one attempt and i<sub>y</sub> &lt; i<sub>x</sub> in another, then either x or y needs to occur multiple times in the password.</li>
<li>thankfully, this was a easy version of the problem. multiplicity would make this tough.
<ul class="org-ul">
<li>each digit was used only once, so if we collect all digits to the right of each digit, then the last one will have no digits to the right of it.</li>
<li>so we can recursively build the password from the right.</li>
</ul></li>
</ul>
</div>
</div>
