notes.org
** DONE 80 - Square Root digital expansion                              :d20:
I'm planning to calculate the integer square root of (n*10^198) and then sum the digits of the result. Floating point precision is hard to keep track of.
I initially planned to leverage my continuted fractions formula, but this seems easier to reason.
<2025-02-27 Thu> I wasted too much time on this. I should have just used bigints. Atleast I wrote my own ~isqrt_~ function to search for it.
#+begin_src julia
mapfoldl(f, +, filter(x -> isqrt(x)^2 != x, 1:100); init=0)
#+end_src

** DONE 81 - Path Sum: Two Ways
Given an NxN matrix, find a minimal path sum from top-left to bottom-right.
In this problem we can only move down and right. In the next two problems these restrictions are reduced.
- this is quite straight forward. One full iteration of the matrix gives the answer

** TODO 82 - Path Sum: Three Ways                                       :d20:
Here we can move up, down and right. We have to find the minimal path from left edge to right edge.
- I need to be careful of orientation, my ~read_matrix~ function is giving me transpose matrix.

** TODO 83 - PathSum: Four Ways                                         :d25:
Here we can move up, down, left, right. Minimal path from top-left to bottom-right.

** TODO 84 - Monopoly Odds                                              :d35:


** DONE 85 - Counting Rectangles
- let us assume the bottom-right corner is (0, 0) and top-left cornor is (x, y)
- for each (a, b) 0 < a <= x, 0 < b <= y we count the following
  + count all the rectangles with top-left corner at (a, b)
  + this will be a*b
- so the sum will be ab(a+1)(b+1)/4
- now I should find nearest product of two triangular numbers to ub=2*10^6
  + for each triangular number, I will find the maximum triangular that can be multipled to be below ub, and minimum triangular number that can be multiplied to be above ub
  + minimum of all the above collected is our answer.

** TODO 86 - Cuboid Route                                               :d35:
flatten the cuboid and we will find ourself with one side a, and other side (b+c).
If we first choose to meet on the middle of edge _a_, then the smallest distance is
$\sqrt(a^2+(b+c)^2)$. The shortest route candidate needs a to be the largest of (a, b, c).
all permutations only differ in $2\cdot b\cdot c$.
1. find a pythagorian triple (x, y, z) where x < y < z.
2. a = y, b+c = x. So there will be (x-1) cuboids with the smallest distance as integer z.
3. a = x, b+c = y. b and c both must be less than a. $\lfloor y \div 2 \rfloor - x + 2$; Am I double counting here...
I am missing something...

** DONE 87 - Prime Power Triples
How many numbers below 50 million can be expressed as the sum of prime square, cube, 4th power.
- n = p^2 + q^3 + r^4 (p, q, r are primes)
- the number of primes to look at is 331, almost 36 million choices; with numbers going upto 10 trillion.
- solved it, runs in < 0.9sec
  + I only summed the powers if they are below bounds. as the number will be definitely out of bounds, we ignore it and dont store it.

** TODO 88 - Product Sum Numbers                                        :d40:

** TODO 89 - Roman Numerals                                             :d20:
Wow this looks tedious

** TODO 90 - Cube Digit Pairs                                           :d40:
** TODO 91 - Right Triangles With Integer Coordinates                   :d25:
Combinatorics??? Or will it become Diophantine?
A=(a, b) and X=(x, y). Suppose OA is the hypotenuse of OAX.
\begin{gather}
  a^2+b^2 = x^2+y^2+(a-x)^2+(b-x)^2 \Longrightarrow x^2+y^2-ax-by = 0 \\
  (x-\dfrac{a}{2})^2 + (y-\dfrac{b}{2})^2 = \dfrac{a^2+b^2}{4}
\end{gather}
Integer points on the circle with diameter \(\overrightarrow{OA}\).

** DONE 92 - Square Digit Chains
- easier than other chain problems(like factorial) since the upper bound ensures we don't need to do initial transitive closure above the upper bound values
- since I construct the whole chain my solution to longer ~ 3 secs

** TODO 93 - Arithmetic Expressions                                     :d35:
Wow, this is quite different
- I have to find the number of trees possible first.
- Then choose the operators for branching nodes, numbers for leaves.

** DONE 94 - Almost Equilateral Triangles                    :pells_equation:
Almost Equilateral Triangle:: two sides are equal and they differ from the third by atmost 1.
Find the sum of perimeters of all these triangles whose side lengths and area are integral, whose perimeters do not exceed one billion.
\begin{gather}
  n^2 = (\frac{n \pm 1}{2})^2 + x^2 \qquad \Longrightarrow \qquad
  (\frac{3n\pm1}{2})^2 - 3x^2 = 1\\
  Area = x \cdot \frac{n\pm1}{2}
\end{gather}

Now we have pell's equation \(y^2 - 3x^2 = 1\). If \(y \not\equiv 0 (mod 3)\) then it is a solution to our problem.
I just noticed that y cannot be 0 mod 3, otherwise 3 will divide 1.
x=2, y=1 is a fundamental solution to \(x^2-3y^2=1\), so we just need to generate additional solutions within the given bounds and check them for our requirements.
\begin{equation}
\begin{matrix}
  \displaystyle x_{k+1} \\
  y_{k+1}
\end{matrix} = \begin{bmatrix}
  x_1 & y_1 \cdot n \\
  y_1 & x_1
\end{bmatrix}\begin{matrix}
  x_k \\
  y_k
\end{matrix}
\end{equation}
This recurrence relation will give us solution in increasing order, so we can stop when reach the required upperbound.
Perimeter is \(3n\pm2\), so \(n\leq\dfrac{10^9+2}{3}\), i.e., 333333334.
The fundamental solution (2, 1) gives a empty triangle 1-1-0, with zero area, so we need to ignore that. The rest of solutions all give a triangle.
#+begin_src julia
sum(m -> isalmost△(m)[2], pells_3((x, y) -> x > 333333334)) - 2
#+end_src

