notes.html

<div id="outline-container-orgadaf829" class="outline-3">
<h3 id="orgadaf829"><span class="done DONE">DONE</span> 80 - Square Root digital expansion&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d20">d20</span></span></h3>
<div class="outline-text-3" id="text-orgadaf829">
<p>
I'm planning to calculate the integer square root of (n*10<sup>198</sup>) and then sum the digits of the result. Floating point precision is hard to keep track of.
I initially planned to leverage my continuted fractions formula, but this seems easier to reason.
<span class="timestamp-wrapper"><span class="timestamp">&lt;2025-02-27 Thu&gt; </span></span> I wasted too much time on this. I should have just used bigints. Atleast I wrote my own <code>isqrt_</code> function to search for it.
</p>
<div class="org-src-container">
<pre class="src src-julia">mapfoldl(f, +, filter(x -&gt; isqrt(x)^2 != x, 1:100); init=0)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd63efca" class="outline-3">
<h3 id="orgd63efca"><span class="done DONE">DONE</span> 81 - Path Sum: Two Ways</h3>
<div class="outline-text-3" id="text-orgd63efca">
<p>
Given an NxN matrix, find a minimal path sum from top-left to bottom-right.
In this problem we can only move down and right. In the next two problems these restrictions are reduced.
</p>
<ul class="org-ul">
<li>this is quite straight forward. One full iteration of the matrix gives the answer</li>
</ul>
</div>
</div>

<div id="outline-container-orgd0f47be" class="outline-3">
<h3 id="orgd0f47be"><span class="todo TODO">TODO</span> 82 - Path Sum: Three Ways&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d20">d20</span></span></h3>
<div class="outline-text-3" id="text-orgd0f47be">
<p>
Here we can move up, down and right. We have to find the minimal path from left edge to right edge.
</p>
<ul class="org-ul">
<li>I need to be careful of orientation, my <code>read_matrix</code> function is giving me transpose matrix.</li>
</ul>
</div>
</div>

<div id="outline-container-org1b9f48d" class="outline-3">
<h3 id="org1b9f48d"><span class="todo TODO">TODO</span> 83 - PathSum: Four Ways&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d25">d25</span></span></h3>
<div class="outline-text-3" id="text-org1b9f48d">
<p>
Here we can move up, down, left, right. Minimal path from top-left to bottom-right.
</p>
</div>
</div>

<div id="outline-container-org1b824a4" class="outline-3">
<h3 id="org1b824a4"><span class="todo TODO">TODO</span> 84 - Monopoly Odds&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d35">d35</span></span></h3>
</div>


<div id="outline-container-orga2d2a43" class="outline-3">
<h3 id="orga2d2a43"><span class="done DONE">DONE</span> 85 - Counting Rectangles</h3>
<div class="outline-text-3" id="text-orga2d2a43">
<ul class="org-ul">
<li>let us assume the bottom-right corner is (0, 0) and top-left cornor is (x, y)</li>
<li>for each (a, b) 0 &lt; a &lt;= x, 0 &lt; b &lt;= y we count the following
<ul class="org-ul">
<li>count all the rectangles with top-left corner at (a, b)</li>
<li>this will be a*b</li>
</ul></li>
<li>so the sum will be ab(a+1)(b+1)/4</li>
<li>now I should find nearest product of two triangular numbers to ub=2*10<sup>6</sup>
<ul class="org-ul">
<li>for each triangular number, I will find the maximum triangular that can be multipled to be below ub, and minimum triangular number that can be multiplied to be above ub</li>
<li>minimum of all the above collected is our answer.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1013139" class="outline-3">
<h3 id="org1013139"><span class="todo TODO">TODO</span> 86 - Cuboid Route&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d35">d35</span></span></h3>
<div class="outline-text-3" id="text-org1013139">
<p>
flatten the cuboid and we will find ourself with one side a, and other side (b+c).
If we first choose to meet on the middle of edge <span class="underline">a</span>, then the smallest distance is
\(\sqrt(a^2+(b+c)^2)\). The shortest route candidate needs a to be the largest of (a, b, c).
all permutations only differ in \(2\cdot b\cdot c\).
</p>
<ol class="org-ol">
<li>find a pythagorian triple (x, y, z) where x &lt; y &lt; z.</li>
<li>a = y, b+c = x. So there will be (x-1) cuboids with the smallest distance as integer z.</li>
<li>a = x, b+c = y. b and c both must be less than a. \(\lfloor y \div 2 \rfloor - x + 2\); Am I double counting here&#x2026;</li>
</ol>
<p>
I am missing something&#x2026;
</p>
</div>
</div>

<div id="outline-container-org49e62a1" class="outline-3">
<h3 id="org49e62a1"><span class="done DONE">DONE</span> 87 - Prime Power Triples</h3>
<div class="outline-text-3" id="text-org49e62a1">
<p>
How many numbers below 50 million can be expressed as the sum of prime square, cube, 4th power.
</p>
<ul class="org-ul">
<li>n = p<sup>2</sup> + q<sup>3</sup> + r<sup>4</sup> (p, q, r are primes)</li>
<li>the number of primes to look at is 331, almost 36 million choices; with numbers going upto 10 trillion.</li>
<li>solved it, runs in &lt; 0.9sec
<ul class="org-ul">
<li>I only summed the powers if they are below bounds. as the number will be definitely out of bounds, we ignore it and dont store it.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org2904350" class="outline-3">
<h3 id="org2904350"><span class="todo TODO">TODO</span> 88 - Product Sum Numbers&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d40">d40</span></span></h3>
</div>

<div id="outline-container-orgbef051c" class="outline-3">
<h3 id="orgbef051c"><span class="todo TODO">TODO</span> 89 - Roman Numerals&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d20">d20</span></span></h3>
<div class="outline-text-3" id="text-orgbef051c">
<p>
Wow this looks tedious
</p>
</div>
</div>

<div id="outline-container-org1a00579" class="outline-3">
<h3 id="org1a00579"><span class="todo TODO">TODO</span> 90 - Cube Digit Pairs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d40">d40</span></span></h3>
</div>
<div id="outline-container-org8f615b9" class="outline-3">
<h3 id="org8f615b9"><span class="todo TODO">TODO</span> 91 - Right Triangles With Integer Coordinates&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d25">d25</span></span></h3>
<div class="outline-text-3" id="text-org8f615b9">
<p>
Combinatorics??? Or will it become Diophantine?
A=(a, b) and X=(x, y). Suppose OA is the hypotenuse of OAX.
</p>
\begin{gather}
  a^2+b^2 = x^2+y^2+(a-x)^2+(b-x)^2 \Longrightarrow x^2+y^2-ax-by = 0 \\
  (x-\dfrac{a}{2})^2 + (y-\dfrac{b}{2})^2 = \dfrac{a^2+b^2}{4}
\end{gather}
<p>
Integer points on the circle with diameter \(\overrightarrow{OA}\).
</p>
</div>
</div>

<div id="outline-container-org17cbe6b" class="outline-3">
<h3 id="org17cbe6b"><span class="done DONE">DONE</span> 92 - Square Digit Chains</h3>
<div class="outline-text-3" id="text-org17cbe6b">
<ul class="org-ul">
<li>easier than other chain problems(like factorial) since the upper bound ensures we don't need to do initial transitive closure above the upper bound values</li>
<li>since I construct the whole chain my solution to longer ~ 3 secs</li>
</ul>
</div>
</div>

<div id="outline-container-org23f63bc" class="outline-3">
<h3 id="org23f63bc"><span class="todo TODO">TODO</span> 93 - Arithmetic Expressions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d35">d35</span></span></h3>
<div class="outline-text-3" id="text-org23f63bc">
<p>
Wow, this is quite different
</p>
<ul class="org-ul">
<li>I have to find the number of trees possible first.</li>
<li>Then choose the operators for branching nodes, numbers for leaves.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfc93ee1" class="outline-3">
<h3 id="orgfc93ee1"><span class="done DONE">DONE</span> 94 - Almost Equilateral Triangles&#xa0;&#xa0;&#xa0;<span class="tag"><span class="pells_equation">pells_equation</span></span></h3>
<div class="outline-text-3" id="text-orgfc93ee1">
<p>
Almost Equilateral Triangle:: two sides are equal and they differ from the third by atmost 1.
Find the sum of perimeters of all these triangles whose side lengths and area are integral, whose perimeters do not exceed one billion.
</p>
\begin{gather}
  n^2 = (\frac{n \pm 1}{2})^2 + x^2 \qquad \Longrightarrow \qquad
  (\frac{3n\pm1}{2})^2 - 3x^2 = 1\\
  Area = x \cdot \frac{n\pm1}{2}
\end{gather}

<p>
Now we have pell's equation \(y^2 - 3x^2 = 1\). If \(y \not\equiv 0 (mod 3)\) then it is a solution to our problem.
I just noticed that y cannot be 0 mod 3, otherwise 3 will divide 1.
x=2, y=1 is a fundamental solution to \(x^2-3y^2=1\), so we just need to generate additional solutions within the given bounds and check them for our requirements.
</p>
\begin{equation}
\begin{matrix}
  \displaystyle x_{k+1} \\
  y_{k+1}
\end{matrix} = \begin{bmatrix}
  x_1 & y_1 \cdot n \\
  y_1 & x_1
\end{bmatrix}\begin{matrix}
  x_k \\
  y_k
\end{matrix}
\end{equation}
<p>
This recurrence relation will give us solution in increasing order, so we can stop when reach the required upperbound.
Perimeter is \(3n\pm2\), so \(n\leq\dfrac{10^9+2}{3}\), i.e., 333333334.
The fundamental solution (2, 1) gives a empty triangle 1-1-0, with zero area, so we need to ignore that. The rest of solutions all give a triangle.
</p>
<div class="org-src-container">
<pre class="src src-julia">sum(m -&gt; isalmost&#9651;(m)[2], pells_3((x, y) -&gt; x &gt; 333333334)) - 2
</pre>
</div>
</div>
</div>
