notes.org
** DONE 95 - Amicable Chains
I actually forgot that sum of divisors has a closed formula, given a prime factorization. Previously I just got all divisors and summed them up, but the combinatorics was taking too much time.
- with a better sum of divisors, this problem is not much different than other _chain_ problems.
My first 30% problem, this didn't didn't feel that hard.

** TODO 96 - Su Doku                                                    :d25:
I'm finally writing a sudoku solver.

** DONE 97 - Large Non-Mersenne Prime
- rolled my own ~powermod~ instead of using the builtin one.

** TODO 98 - Anagramic Squares                                          :d35:
- two words must be permutations of each other, so the substituted numbers must be digit permutations of each other.
- we can check if two words are permutations by ~count_freq~.
  + first we collect all the permutations into bunches
- if the number of letters is 10, then we > 3million checks to make, that is for just one bunch.


** DONE 99 - Largest Exponential
logarithm is monotonic, so we can compare logarithms instead of exponentials.
I need to learn about floats more. Can I estimate how much error floating point representation causes? How much precision is needed for the given range of numbers??
Let me try this out first.
- it worked, Float64 precision helped. all the numbers seem to be around 6.919e6 range
#+begin_src julia
maximum(i -> reverse(i), enumerate(map(f, ns)))
#+end_src
- with builtin dictionary order comparisons things are becoming easy.

** DONE 100 - Arranged Probability                           :pells_equation:
Let (b, r) be the number of blue and red discs respectively.
- If \(\displaystyle b+r=n\),
  \begin{align}
    \mathbb{P}(BB)=\dfrac{b}{n}\cdot\dfrac{b-1}{n-1} \\
    \mathbb{P}(BB)=\dfrac{1}{2} \Longrightarrow 2b(b-1) = n(n-1) \\
    2(2b-1)^2 - (2n-1)^2=1
  \end{align}
We have pell's equation of the form \(x^2-2y^2=-1\), where \(x=1, y=1\) is a fundamental solution. For negative pell's equations, the additional solutions work a bit differently
\begin{equation}
\begin{matrix}
  x_{k+2} \\
  y_{k+2}
\end{matrix} = \begin{bmatrix}
  x_1^2+ny_1^2 & 2ny_1x_1 \\
  2y_1x_1 & x_1^2+ny_1^2
\end{bmatrix}
\begin{matrix}
  x_k \\
  y_k
\end{matrix}
\end{equation}
So the inner matrix is
\begin{bmatrix}
  3 & 4 \\ 2 & 3
\end{bmatrix}
