notes.html

<div id="outline-container-orgb8bc98f" class="outline-3">
<h3 id="orgb8bc98f"><span class="done DONE">DONE</span> 95 - Amicable Chains</h3>
<div class="outline-text-3" id="text-orgb8bc98f">
<p>
I actually forgot that sum of divisors has a closed formula, given a prime factorization. Previously I just got all divisors and summed them up, but the combinatorics was taking too much time.
</p>
<ul class="org-ul">
<li>with a better sum of divisors, this problem is not much different than other <span class="underline">chain</span> problems.</li>
</ul>
<p>
My first 30% problem, this didn't didn't feel that hard.
</p>
</div>
</div>

<div id="outline-container-org1c50741" class="outline-3">
<h3 id="org1c50741"><span class="todo TODO">TODO</span> 96 - Su Doku&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d25">d25</span></span></h3>
<div class="outline-text-3" id="text-org1c50741">
<p>
I'm finally writing a sudoku solver.
</p>
</div>
</div>

<div id="outline-container-orgb8c3981" class="outline-3">
<h3 id="orgb8c3981"><span class="done DONE">DONE</span> 97 - Large Non-Mersenne Prime</h3>
<div class="outline-text-3" id="text-orgb8c3981">
<ul class="org-ul">
<li>rolled my own <code>powermod</code> instead of using the builtin one.</li>
</ul>
</div>
</div>

<div id="outline-container-org2861a11" class="outline-3">
<h3 id="org2861a11"><span class="todo TODO">TODO</span> 98 - Anagramic Squares&#xa0;&#xa0;&#xa0;<span class="tag"><span class="d35">d35</span></span></h3>
<div class="outline-text-3" id="text-org2861a11">
<ul class="org-ul">
<li>two words must be permutations of each other, so the substituted numbers must be digit permutations of each other.</li>
<li>we can check if two words are permutations by <code>count_freq</code>.
<ul class="org-ul">
<li>first we collect all the permutations into bunches</li>
</ul></li>
<li>if the number of letters is 10, then we &gt; 3million checks to make, that is for just one bunch.</li>
</ul>
</div>
</div>


<div id="outline-container-org86e1e46" class="outline-3">
<h3 id="org86e1e46"><span class="done DONE">DONE</span> 99 - Largest Exponential</h3>
<div class="outline-text-3" id="text-org86e1e46">
<p>
logarithm is monotonic, so we can compare logarithms instead of exponentials.
I need to learn about floats more. Can I estimate how much error floating point representation causes? How much precision is needed for the given range of numbers??
Let me try this out first.
</p>
<ul class="org-ul">
<li>it worked, Float64 precision helped. all the numbers seem to be around 6.919e6 range</li>
</ul>
<div class="org-src-container">
<pre class="src src-julia">maximum(i -&gt; reverse(i), enumerate(map(f, ns)))
</pre>
</div>
<ul class="org-ul">
<li>with builtin dictionary order comparisons things are becoming easy.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdbfac6e" class="outline-3">
<h3 id="orgdbfac6e"><span class="done DONE">DONE</span> 100 - Arranged Probability&#xa0;&#xa0;&#xa0;<span class="tag"><span class="pells_equation">pells_equation</span></span></h3>
<div class="outline-text-3" id="text-orgdbfac6e">
<p>
Let (b, r) be the number of blue and red discs respectively.
</p>
<ul class="org-ul">
<li><p>
If \(\displaystyle b+r=n\),
</p>
\begin{align}
  \mathbb{P}(BB)=\dfrac{b}{n}\cdot\dfrac{b-1}{n-1} \\
  \mathbb{P}(BB)=\dfrac{1}{2} \Longrightarrow 2b(b-1) = n(n-1) \\
  2(2b-1)^2 - (2n-1)^2=1
\end{align}</li>
</ul>
<p>
We have pell's equation of the form \(x^2-2y^2=-1\), where \(x=1, y=1\) is a fundamental solution. For negative pell's equations, the additional solutions work a bit differently
</p>
\begin{equation}
\begin{matrix}
  x_{k+2} \\
  y_{k+2}
\end{matrix} = \begin{bmatrix}
  x_1^2+ny_1^2 & 2ny_1x_1 \\
  2y_1x_1 & x_1^2+ny_1^2
\end{bmatrix}
\begin{matrix}
  x_k \\
  y_k
\end{matrix}
\end{equation}
<p>
So the inner matrix is
</p>
\begin{bmatrix}
  3 & 4 \\ 2 & 3
\end{bmatrix}
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: k3ut0i</p>
<p class="date">Created: 2025-02-27 Thu 15:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
